[Survived] String mutation
miguel-pvs/Project1/Data/AppDbContext.cs:19:34
         public DbSet<Absent> Absent { get; set; }
 
         protected override void OnConfiguring(DbContextOptionsBuilder options)
-            => options.UseSqlite(@"Data Source=DB.db");
+            => options.UseSqlite("");
 
         protected override void OnModelCreating(ModelBuilder modelBuilder)
