[NoCoverage] String mutation
miguel-pvs/Project1/Exceptions/ApiExceptionsMiddleware.cs:33:55
             catch (ValidationException e)
             {
                 httpContext.Response.StatusCode = 400;
-                await httpContext.Response.WriteAsync("Validation failed for request: " + e.Message);
+                await httpContext.Response.WriteAsync("" + e.Message);
                 foreach (KeyValuePair<string, string[]> failure in e.Failures)
                 {
