[Killed] Object initializer mutation
miguel-pvs/Project1/Infrastructure/UnsService.cs:33:42
         public async Task PublishCheckInAsync(ApplicationUser checkInUser,DateTime now, CancellationToken cancellationToken)
 
         {
-            CheckInPayLoad messageJson = new CheckInPayLoad()
-            {
-                Value = checkInUser.CheckedIn,
-                Timestamp = now
-            };
+            CheckInPayLoad messageJson = new CheckInPayLoad()
+{};
             string payLoad = JsonConvert.SerializeObject(messageJson);
             string topic = $"users/{checkInUser.Id}/pvs/checked_in";

[Killed] String mutation
miguel-pvs/Project1/Infrastructure/UnsService.cs:51:28
             List<string> listTopics = new List<string>();
 
             listTopics.Add($"users/{userId}/pvs/checked_in");
-            listTopics.Add($"locations/{userOfficeLocation}/pvs/mechanics");
+            listTopics.Add($"");
             listTopics.Add($"users/{userId}/pvs/Schedule");
             listTopics.Add($"users/{userId}/pvs/Schedule/today");

[Killed] Negate expression
miguel-pvs/Project1/Infrastructure/UnsService.cs:170:17
             DayOfWeek today = DateTime.UtcNow.DayOfWeek;
 
 
-            if (startTime <= currentTime & endTime >= currentTime & workPatternPart.Day == today)
+            if (!(startTime <= currentTime & endTime >= currentTime & workPatternPart.Day == today))
             {
                 _scheduleToWorkNow = true;

[Survived] Object initializer mutation
miguel-pvs/Project1/Infrastructure/UnsService.cs:179:41
 
         {
             DayOfWeek dayOfWeekToday = DateTime.Today.DayOfWeek;
-            TodaySchedule messageJson = new TodaySchedule()
-            {
-                From = TimeSpan.Zero,
-                Till = TimeSpan.Zero
-            };
+            TodaySchedule messageJson = new TodaySchedule()
+{};
 
             if (workPatternPart.Day == dayOfWeekToday)

[Killed] Equality mutation
miguel-pvs/Project1/Infrastructure/UnsService.cs:207:17
             DateTime? endWorkPattern = workPattern.EndDate;
             bool insideWorkPattern;
 
-            if (today >= beginWorkPattern & today <= endWorkPattern)
+            if (today > beginWorkPattern & today <= endWorkPattern)
             {
                 insideWorkPattern = true;

[Killed] Bitwise mutation
miguel-pvs/Project1/Infrastructure/UnsService.cs:298:21
                 TimeSpan startPart = part.StartTime;
                 TimeSpan endPart = part.EndTime;
 
-                if ((startPart >= startAbsent) & (endPart >= endAbsent) & (startPart <= endAbsent) & (endPart >= startAbsent))
+                if ((startPart >= startAbsent) & (endPart >= endAbsent) | (startPart <= endAbsent) & (endPart >= startAbsent))
                 {
                     newListWorkPatternPartToAdd.Remove(part);

[Killed] Equality mutation
miguel-pvs/Project1/Infrastructure/UnsService.cs:298:51
                 TimeSpan startPart = part.StartTime;
                 TimeSpan endPart = part.EndTime;
 
-                if ((startPart >= startAbsent) & (endPart >= endAbsent) & (startPart <= endAbsent) & (endPart >= startAbsent))
+                if ((startPart >= startAbsent) & (endPart < endAbsent) & (startPart <= endAbsent) & (endPart >= startAbsent))
                 {
                     newListWorkPatternPartToAdd.Remove(part);

[Killed] Equality mutation
miguel-pvs/Project1/Infrastructure/UnsService.cs:304:56
                     part.StartTime = endAbsent;
                     newListWorkPatternPartToAdd.Add(part);
                 }
-                else if ((startPart <= startAbsent) & (endPart <= endAbsent) & (startPart <= endAbsent) & (endPart >= startAbsent))
+                else if ((startPart <= startAbsent) & (endPart > endAbsent) & (startPart <= endAbsent) & (endPart >= startAbsent))
                 {
                     newListWorkPatternPartToAdd.Remove(part);

[Killed] Equality mutation
miguel-pvs/Project1/Infrastructure/UnsService.cs:310:27
                     part.EndTime = startAbsent;
                     newListWorkPatternPartToAdd.Add(part);
                 }
-                else if ((startPart <= startAbsent) & (endPart >= endAbsent))
+                else if ((startPart > startAbsent) & (endPart >= endAbsent))
                 {
                     newListWorkPatternPartToAdd.Remove(part);

[Killed] Negate expression
miguel-pvs/Project1/Infrastructure/UnsService.cs:310:26
                     part.EndTime = startAbsent;
                     newListWorkPatternPartToAdd.Add(part);
                 }
-                else if ((startPart <= startAbsent) & (endPart >= endAbsent))
+                else if (!((startPart <= startAbsent) & (endPart >= endAbsent)))
                 {
                     newListWorkPatternPartToAdd.Remove(part);

[Killed] Object initializer mutation
miguel-pvs/Project1/Infrastructure/UnsService.cs:322:38
                         EndTime = startAbsent,
                     };
 
-                    var partSplit2 = new WorkPatternPart
-                    {
-                        Id = new Guid(),
-                        Day = part.Day,
-                        StartTime = endAbsent,
-                        EndTime = endPart,
-                     };
+                    var partSplit2 = new WorkPatternPart
+{};
                     newListWorkPatternPartToAdd.Add(partSplit1);
                     newListWorkPatternPartToAdd.Add(partSplit2);

[Killed] Negate expression
miguel-pvs/Project1/Infrastructure/UnsService.cs:332:26
                     newListWorkPatternPartToAdd.Add(partSplit1);
                     newListWorkPatternPartToAdd.Add(partSplit2);
                 }
-                else if ((startPart >= startAbsent) & (startPart <= endAbsent))
+                else if (!((startPart >= startAbsent) & (startPart <= endAbsent)))
                 {
                     newListWorkPatternPartToAdd.Remove(part);

[Killed] Equality mutation
miguel-pvs/Project1/Infrastructure/UnsService.cs:372:17
             newListTodayToAdd = newListTodayToAdd.OrderBy(x => x.Till).ToList();
             newListTodayToAdd = newListTodayToAdd.OrderBy(x => x.From).ToList();
 
-            if (from <= tillPrevious & till >= fromPrevious & till >= tillPrevious)
+            if (from > tillPrevious & till >= fromPrevious & till >= tillPrevious)
             {
                 newListTodayToAdd.Remove(previousToday);

[Killed] Bitwise mutation
miguel-pvs/Project1/Infrastructure/UnsService.cs:372:17
             newListTodayToAdd = newListTodayToAdd.OrderBy(x => x.Till).ToList();
             newListTodayToAdd = newListTodayToAdd.OrderBy(x => x.From).ToList();
 
-            if (from <= tillPrevious & till >= fromPrevious & till >= tillPrevious)
+            if (from <= tillPrevious & till >= fromPrevious | till >= tillPrevious)
             {
                 newListTodayToAdd.Remove(previousToday);

[Killed] String mutation
miguel-pvs/Project1/Infrastructure/UnsService.cs:417:28
 
         {
             string todaySchedule = JsonConvert.SerializeObject(todayList);
-            string topic = $"users/{Convert.ToString(id)}/pvs/Schedule/today";
+            string topic = $"";
             await PublishOnTopicAsync(todaySchedule, topic, cancellationToken);
         }
