[NoCoverage] String mutation
miguel-pvs/Project1/Migrations/20221024082434_InitialMigration.cs:17:37
                 columns: table => new
                 {
                     Id = table.Column<int>(type: "INTEGER", nullable: false)
-                        .Annotation("Sqlite:Autoincrement", true),
+                        .Annotation("", true),
                     FirstName = table.Column<string>(type: "TEXT", nullable: false),
                     OfficeLocation = table.Column<int>(type: "INTEGER", nullable: false),

[NoCoverage] String mutation
miguel-pvs/Project1/Migrations/20221024082434_InitialMigration.cs:34:60
                     Id = table.Column<Guid>(type: "TEXT", nullable: false),
                     UserId = table.Column<int>(type: "INTEGER", nullable: false),
                     StartDate = table.Column<DateTime>(type: "TEXT", nullable: false),
-                    EndDate = table.Column<DateTime>(type: "TEXT", nullable: true)
+                    EndDate = table.Column<DateTime>(type: "", nullable: true)
                 },
                 constraints: table =>

[NoCoverage] String mutation
miguel-pvs/Project1/Migrations/20221024082434_InitialMigration.cs:38:38
                 },
                 constraints: table =>
                 {
-                    table.PrimaryKey("PK_WorkPattern", x => x.Id);
+                    table.PrimaryKey("", x => x.Id);
                     table.ForeignKey(
                         name: "FK_WorkPattern_Users_UserId",

[NoCoverage] String mutation
miguel-pvs/Project1/Migrations/20221024082434_InitialMigration.cs:42:41
                     table.ForeignKey(
                         name: "FK_WorkPattern_Users_UserId",
                         column: x => x.UserId,
-                        principalTable: "Users",
+                        principalTable: "",
                         principalColumn: "Id",
                         onDelete: ReferentialAction.Cascade);

[NoCoverage] String mutation
miguel-pvs/Project1/Migrations/20221024082434_InitialMigration.cs:51:51
                 name: "Absent",
                 columns: table => new
                 {
-                    Id = table.Column<Guid>(type: "TEXT", nullable: false),
+                    Id = table.Column<Guid>(type: "", nullable: false),
                     UserId = table.Column<int>(type: "INTEGER", nullable: false),
                     workPatternId = table.Column<Guid>(type: "TEXT", nullable: true),

[NoCoverage] String mutation
miguel-pvs/Project1/Migrations/20221024082434_InitialMigration.cs:64:42
                         name: "FK_Absent_Users_UserId",
                         column: x => x.UserId,
                         principalTable: "Users",
-                        principalColumn: "Id",
+                        principalColumn: "",
                         onDelete: ReferentialAction.Cascade);
                     table.ForeignKey(

[NoCoverage] String mutation
miguel-pvs/Project1/Migrations/20221024082434_InitialMigration.cs:79:62
                 {
                     Id = table.Column<Guid>(type: "TEXT", nullable: false),
                     Day = table.Column<int>(type: "INTEGER", nullable: false),
-                    StartTime = table.Column<TimeSpan>(type: "TEXT", nullable: false),
+                    StartTime = table.Column<TimeSpan>(type: "", nullable: false),
                     EndTime = table.Column<TimeSpan>(type: "TEXT", nullable: false),
                     WorkPatternId = table.Column<Guid>(type: "TEXT", nullable: true)

[NoCoverage] String mutation
miguel-pvs/Project1/Migrations/20221024082434_InitialMigration.cs:96:24
 
             migrationBuilder.CreateIndex(
                 name: "IX_Absent_UserId",
-                table: "Absent",
+                table: "",
                 column: "UserId");
 

[NoCoverage] String mutation
miguel-pvs/Project1/Migrations/20221024082434_InitialMigration.cs:101:24
 
             migrationBuilder.CreateIndex(
                 name: "IX_Absent_workPatternId",
-                table: "Absent",
+                table: "",
                 column: "workPatternId");
 
