[NoCoverage] String mutation
miguel-pvs/Project1/Migrations/20221026115358_1111.cs:14:24
         {
             migrationBuilder.DropForeignKey(
                 name: "FK_Absent_WorkPattern_workPatternId",
-                table: "Absent");
+                table: "");
 
             migrationBuilder.DropIndex(

[NoCoverage] String mutation
miguel-pvs/Project1/Migrations/20221026115358_1111.cs:21:23
                 table: "Absent");
 
             migrationBuilder.DropColumn(
-                name: "workPatternId",
+                name: "",
                 table: "Absent");
         }

[NoCoverage] String mutation
miguel-pvs/Project1/Migrations/20221026115358_1111.cs:40:24
 
             migrationBuilder.AddForeignKey(
                 name: "FK_Absent_WorkPattern_workPatternId",
-                table: "Absent",
+                table: "",
                 column: "workPatternId",
                 principalTable: "WorkPattern",
