[Killed] Block removal mutation
miguel-pvs/Project1/Persistance/AbsentRepositoy.cs:78:9
 
         }
         public async Task<Absent> DeleteAbsentAsync(Guid id, CancellationToken cancellationToken)
-        {
-            var result = await _context.Absent.FirstOrDefaultAsync(x => x.Id == id, cancellationToken);
-            try
-            {
-                _context.Absent.Remove(result);
-                _context.SaveChanges();
-            }
-            catch
-            {
-
-            }
-            return result;
-        }
+        {}
     }
 
