[Killed] Block removal mutation
miguel-pvs/Project1/Persistance/ApplicationUserRepository.cs:36:9
         }
 
         public async Task<ApplicationUser> UpdateApplicationUserAsync(ApplicationUser user, CancellationToken cancellationToken)
-        {
-            if (user is null)
-            {
-                throw new ArgumentNullException(nameof(user));
-            }
-
-            var userInDb = await _context.Users.Include(x => x.WorkPatterns).ThenInclude(x => x.Parts).FirstOrDefaultAsync(x => x.Id == user.Id, cancellationToken);
-
-            if (userInDb != null)
-            {
-                userInDb.FirstName = user.FirstName;
-                userInDb.OfficeLocation = user.OfficeLocation;
-                userInDb.CheckedIn = user.CheckedIn;
-                await _context.SaveChangesAsync();
-            }
-            return userInDb;
-        }
+        {}
 
         public Task<ApplicationUser> GetApplicationUserAsync(int id, CancellationToken cancellationToken) => GetApplicationUserAsync(id, true, cancellationToken);

[Killed] Equality mutation
miguel-pvs/Project1/Persistance/ApplicationUserRepository.cs:44:17
 
             var userInDb = await _context.Users.Include(x => x.WorkPatterns).ThenInclude(x => x.Parts).FirstOrDefaultAsync(x => x.Id == user.Id, cancellationToken);
 
-            if (userInDb != null)
+            if (userInDb == null)
             {
                 userInDb.FirstName = user.FirstName;

[Killed] Block removal mutation
miguel-pvs/Project1/Persistance/ApplicationUserRepository.cs:45:13
             var userInDb = await _context.Users.Include(x => x.WorkPatterns).ThenInclude(x => x.Parts).FirstOrDefaultAsync(x => x.Id == user.Id, cancellationToken);
 
             if (userInDb != null)
-            {
-                userInDb.FirstName = user.FirstName;
-                userInDb.OfficeLocation = user.OfficeLocation;
-                userInDb.CheckedIn = user.CheckedIn;
-                await _context.SaveChangesAsync();
-            }
+            {}
             return userInDb;
         }

[Survived] Statement mutation
miguel-pvs/Project1/Persistance/ApplicationUserRepository.cs:49:17
                 userInDb.FirstName = user.FirstName;
                 userInDb.OfficeLocation = user.OfficeLocation;
                 userInDb.CheckedIn = user.CheckedIn;
-                await _context.SaveChangesAsync();
+                ;
             }
             return userInDb;
