[Killed] Block removal mutation
miguel-pvs/Project1/Persistance/WorkPatternRepository.cs:44:9
             return workPattern;
         }
         public async Task<WorkPattern> UpdateWorkPatternAsync(WorkPattern workPattern, CancellationToken cancellationToken)
-        {
-            if (workPattern is null)
-            {
-                throw new ArgumentNullException(nameof(workPattern));
-            }
-
-            var result = await _context.WorkPattern.Include(x => x.Parts).FirstOrDefaultAsync(x => x.Id == workPattern.Id, cancellationToken);
-            if (result != null)
-            {
-                result.StartDate = workPattern.StartDate;
-                result.EndDate = workPattern.EndDate;
-                result.Parts = workPattern.Parts;
-            }
-            return result;
-        }
+        {}
         public async Task<WorkPattern> GetWorkPatternAsync(Guid id, CancellationToken cancellationToken)
         {

[Killed] Equality mutation
miguel-pvs/Project1/Persistance/WorkPatternRepository.cs:51:17
             }
 
             var result = await _context.WorkPattern.Include(x => x.Parts).FirstOrDefaultAsync(x => x.Id == workPattern.Id, cancellationToken);
-            if (result != null)
+            if (result == null)
             {
                 result.StartDate = workPattern.StartDate;

[Killed] Block removal mutation
miguel-pvs/Project1/Persistance/WorkPatternRepository.cs:52:13
 
             var result = await _context.WorkPattern.Include(x => x.Parts).FirstOrDefaultAsync(x => x.Id == workPattern.Id, cancellationToken);
             if (result != null)
-            {
-                result.StartDate = workPattern.StartDate;
-                result.EndDate = workPattern.EndDate;
-                result.Parts = workPattern.Parts;
-            }
+            {}
             return result;
         }
