[NoCoverage] Equality mutation
repos/miguel-pvs/Project1/RequestValidationBehaviour.cs:27:17
                 .Where(f => f != null)
                 .ToList();
 
-            if (failures.Count > 0)
+            if (failures.Count >= 0)
             {
                 failures.ForEach(f =>
