[NoCoverage] Negate expression
miguel-pvs/Project1/Timers/TimerService.cs:140:20
                 var eventPublishWorkPattern = new PublishWorkPatternEvent(user);
                 await _mediator.Publish(eventPublishWorkPattern, token);
 
-                if(delayTask < TimeSpan.Zero)
+                if(!(delayTask < TimeSpan.Zero))
                 {
                     delayTask = TimeSpan.FromSeconds(1);

[Killed] Negate expression
miguel-pvs/Project1/Timers/TimerService.cs:223:50
                                         {
                                             delays.Add(TimeSpan.FromDays(dayIndex) + start - nowTimeOfDay);
                                         }
-                                        else if ((nowTimeOfDay < end) & (nowTimeOfDay >= start))
+                                        else if (!((nowTimeOfDay < end) & (nowTimeOfDay >= start)))
                                         {
                                             delays.Add(TimeSpan.FromDays(dayIndex) + end - nowTimeOfDay);

[Killed] Arithmetic mutation
miguel-pvs/Project1/Timers/TimerService.cs:225:56
                                         }
                                         else if ((nowTimeOfDay < end) & (nowTimeOfDay >= start))
                                         {
-                                            delays.Add(TimeSpan.FromDays(dayIndex) + end - nowTimeOfDay);
+                                            delays.Add(TimeSpan.FromDays(dayIndex) + end + nowTimeOfDay);
                                         }
                                         else if ((nowTimeOfDay >= end))

[Killed] Equality mutation
miguel-pvs/Project1/Timers/TimerService.cs:227:51
                                         {
                                             delays.Add(TimeSpan.FromDays(dayIndex) + end - nowTimeOfDay);
                                         }
-                                        else if ((nowTimeOfDay >= end))
+                                        else if ((nowTimeOfDay < end))
                                         {
                                             TimeSpan beginNextShift = await FindNextPartJumpOneDayAsync(dayIndex, listWorkPatternParts, now, cancellationToken);

[Killed] Arithmetic mutation
miguel-pvs/Project1/Timers/TimerService.cs:230:56
                                         else if ((nowTimeOfDay >= end))
                                         {
                                             TimeSpan beginNextShift = await FindNextPartJumpOneDayAsync(dayIndex, listWorkPatternParts, now, cancellationToken);
-                                            delays.Add(TimeSpan.FromHours(24) - nowTimeOfDay + beginNextShift);
+                                            delays.Add(TimeSpan.FromHours(24) + nowTimeOfDay + beginNextShift);
                                         }
                                     }

[Survived] PostIncrementExpression to PostDecrementExpression mutation
miguel-pvs/Project1/Timers/TimerService.cs:258:47
             TimeSpan lowestStart = TimeSpan.FromHours(24);
             DayOfWeek dayNextNextShift = new DayOfWeek();
             int index = 0;
-            for (index = dayIndex; index < 8; index++)
+            for (index = dayIndex; index < 8; index--)
             {
                 dayNextNextShift = now.AddDays(index).DayOfWeek;

[Killed] Equality mutation
miguel-pvs/Project1/Timers/TimerService.cs:362:17
             newListTodayToAdd = newListTodayToAdd.OrderBy(x => x.EndTime).ToList();
 
 
-            if (startTime <= endPrevious & endTime >= startPrevious & endTime >= endPrevious)
+            if (startTime > endPrevious & endTime >= startPrevious & endTime >= endPrevious)
             {
                 newListTodayToAdd.Remove(previousPart);

[Killed] Equality mutation
miguel-pvs/Project1/Timers/TimerService.cs:362:17
             newListTodayToAdd = newListTodayToAdd.OrderBy(x => x.EndTime).ToList();
 
 
-            if (startTime <= endPrevious & endTime >= startPrevious & endTime >= endPrevious)
+            if (startTime < endPrevious & endTime >= startPrevious & endTime >= endPrevious)
             {
                 newListTodayToAdd.Remove(previousPart);

[Killed] Bitwise mutation
miguel-pvs/Project1/Timers/TimerService.cs:428:21
                 TimeSpan startPart = part.StartTime;
                 TimeSpan endPart = part.EndTime;
 
-                if ((startPart >= startAbsent) & (endPart > endAbsent) & (startPart <= endAbsent) & (endPart >= startAbsent))
+                if ((startPart >= startAbsent) & (endPart > endAbsent) & (startPart <= endAbsent) | (endPart >= startAbsent))
                 {
                     newListWorkPatternPartToAdd.Remove(part);

[Killed] Equality mutation
miguel-pvs/Project1/Timers/TimerService.cs:428:102
                 TimeSpan startPart = part.StartTime;
                 TimeSpan endPart = part.EndTime;
 
-                if ((startPart >= startAbsent) & (endPart > endAbsent) & (startPart <= endAbsent) & (endPart >= startAbsent))
+                if ((startPart >= startAbsent) & (endPart > endAbsent) & (startPart <= endAbsent) & (endPart < startAbsent))
                 {
                     newListWorkPatternPartToAdd.Remove(part);

[Killed] Bitwise mutation
miguel-pvs/Project1/Timers/TimerService.cs:434:26
                     part.StartTime = endAbsent;
                     newListWorkPatternPartToAdd.Add(part);
                 }
-                else if ((startPart < startAbsent) & (endPart <= endAbsent) & (startPart <= endAbsent) & (endPart >= startAbsent))
+                else if ((startPart < startAbsent) & (endPart <= endAbsent) | (startPart <= endAbsent) & (endPart >= startAbsent))
                 {
                     newListWorkPatternPartToAdd.Remove(part);

[Killed] Equality mutation
miguel-pvs/Project1/Timers/TimerService.cs:434:80
                     part.StartTime = endAbsent;
                     newListWorkPatternPartToAdd.Add(part);
                 }
-                else if ((startPart < startAbsent) & (endPart <= endAbsent) & (startPart <= endAbsent) & (endPart >= startAbsent))
+                else if ((startPart < startAbsent) & (endPart <= endAbsent) & (startPart > endAbsent) & (endPart >= startAbsent))
                 {
                     newListWorkPatternPartToAdd.Remove(part);

[Killed] Equality mutation
miguel-pvs/Project1/Timers/TimerService.cs:440:27
                     part.EndTime = startAbsent;
                     newListWorkPatternPartToAdd.Add(part);
                 }
-                else if ((startPart < startAbsent) & (endPart > endAbsent))
+                else if ((startPart > startAbsent) & (endPart > endAbsent))
                 {
                     newListWorkPatternPartToAdd.Remove(part);

[Killed] Equality mutation
miguel-pvs/Project1/Timers/TimerService.cs:440:55
                     part.EndTime = startAbsent;
                     newListWorkPatternPartToAdd.Add(part);
                 }
-                else if ((startPart < startAbsent) & (endPart > endAbsent))
+                else if ((startPart < startAbsent) & (endPart < endAbsent))
                 {
                     newListWorkPatternPartToAdd.Remove(part);

[Killed] Equality mutation
miguel-pvs/Project1/Timers/TimerService.cs:469:17
             }
 
             indexAbsent += 1;
-            if (indexAbsent < numberAbsent)
+            if (indexAbsent > numberAbsent)
             {
                 newListWorkPatternPartFOR.Clear();
